Revit 2026 API

# ExternallyTaggedNonBRep Properties

---

The ExternallyTaggedNonBRep type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | ExternalId | The external Id of the geometry object. (Inherited from ExternallyTaggedGeometryObject) |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. (Inherited from ExternallyTaggedGeometryObject) |

#### Reference

ExternallyTaggedNonBRep Class

Autodesk.Revit.DB Namespace